/*
 *   조건문 => 비교연산자 , 논리연산자 , 부정연산자
 *           -----------------------------
 *           if(-----)
 *   통계 / 분석 / 누적 ==> 산술연산자 
 *   횟수구하기 / 조회수 증가 ==> ++
 *   결과값 읽기 => 대입연산자 
 *   --------------------------------------
 *   
 *   1) 
 *      int a=10; 
 *      => 한개 증가 
 *         a++
 *         ++a
 *         ----------
 *         a=a+1
 *         -------
 *         a+=1 ==> a=a+1
 *         a+=5 ==> a=a+5
 *         ------- 여러개 증가 
 *         a++ a++ ...
 *         a+=10000
 *   2) % => 달력 (윤년) , 숫자 분리 
 *   3) + , - 
 *      +  문자열 결합 ...
 *      += 빈도수 , 석차 ... 
 *      ------------------ 1. 인기 순위 , 2. 실시간 그래프 ...
 *         
 */
public class 연산자문제_14 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
