/*
 *   중첩 for => 반복문 : 웹에서는 사용 빈도가 거의 없다 
 *   --------
 *    1) 코딩 테스트 / 정보처리 
 *    2) 솔루션 
 *   
 *   중첩 
 *   ----
 *     조건문 
 *       if() => 1차
 *       {
 *          if() => 2차 
 *          {
 *          }
 *       }
 *     선택문 
 *       switch()
 *       {
 *          case :
 *            switch()
 *            {
 *               
 *            }
 *       }
 *       
 *      반복문 : 주로 => for
 *      for() ------------------> 줄수
 *      {
 *         for() ---------------> 출력 갯수 
 *         {
 *         }
 *      }
 *      
 *      1번째 줄 ==> 5
 *      2번째 줄 ==> 4...
 *      
 *      형식)          | false 종료
 *               1    2  <-- |--------------
 *          for(초기값;조건식;증가식)          |
 *          {                             |
 *                     | true             |
 *            -------------------------   |
 *                        | false---------
 *                   1    2  <--|------
 *             for(초기값;조건식;증가식)  |
 *             {                     |
 *                        | true     |
 *                    문장 수행 --------
 *             }
 *            --------------------------
 *          }
 *          
 *          예)
 *              1. 몇줄 출력 : 세로
 *              2. 출력은 몇개 ..... 가로
 *              for(int i=1;i<=3;i++) => 종료시에 for 끝난다 
 *              {
 *                 for(int j=1;j<=3;j++)
 *                 {
 *                    
 *                 }
 *              }
 *              
 *              i=1 => j=1 j=2 j=3 => i증가 
 *              i=2 => j=1 j=2 j=3 => i증가 
 *              i=3 => j=1 j=2 j=3 => i증가
 *              i=4 => 종료
 *              
 *              *****
 *              *****
 *              *****
 *              *****    
 *              
 *              1.줄수 : 4 (1-4)
 *              2.출력물 : * ==> 5개 (1-5)
 *              
 *              2*1=2 .....  9*1=9
 *              ..
 *              ..
 *              2*9=18       9*9=81
 *              
 *              1. 일차 for => 9줄을 만든다 
 *              2. 이차 for => 8개를 출력 
 *              -------------------------
 */
public class 중첩_for_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        // 실행 순서 
		
		for(int i=1;i<=5;i++) // 줄수 ==> for횟수는 25
		{
			//////////////////////////// i=1 2차 for문 종료 => i++
			for(int j=1;j<=5;j++) // 출력
			{
				System.out.println("i="+i+",j="+j); // 실제 출력물 2차 
			}
			////////////////////////////
			System.out.println();
		}
		// i=1 => j=1 j=2 j=3 j=4 j=5
		// i=2 => j=1 j=2 j=3 j=4 j=5
		// i=3 => j=1 j=2 j=3 j=4 j=5
		// i=4 => j=1 j=2 j=3 j=4 j=5
		// i=5 => j=1 j=2 j=3 j=4 j=5
		// 종료
	}

}
