/*
 *   25page 
 *    변수/상수 
 *   26page 
 *    1) 형식
 *    2) 식별자 
 *   28page 
 *    1) 변수 초기화 
 *   30page 
 *    1) 데이터형 
 *   ---------------- 암기 
 *    => 변수 , 식별자 , 데이터형 , 변수 초기화 
 *   
 *   사용자 요청 처리 
 *   38page =>  산술연산자 
 *   41page =>  복합대입연산자,증감연산자
 *   44page =>  비교연산자 
 *   45page =>  논리연산자
 *   48page =>  조건연산자 
 *   50~51page => 형변환 
 *   ------------------------------------- 프로그램 : 변수설정,연산자,제어문
 *   변수 => 응용 => 연산자 
 *   연산자 => 응용 => 제어문 
 *   제어문 => 응용 => 메소드 
 *   메소드 => 응용 => 클래스 
 *   -------------------------------- 54page 
 */
public class 교재_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
